Revit 2027 API
RebarUpdateCurvesData.GetRebarId Method
 Get the id of the Rebar element currently being calculated.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetRebarId()
Public Function GetRebarId As ElementId
public:
ElementId^ GetRebarId()
member GetRebarId : unit -> ElementId
Return Value
ElementId
 Returns the id of the Rebar element currently being calculated
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace